# IMPORTS

In [29]:
import numpy as np
import pandas as pd

## DATASETS LOADING
1. The data are split in two files, load the files and merge them according to the first column, which is the index; both the files contain a "class" column, keep both the columns in the merged file calling them "class_x" and "class_y" (you can use the merge function of pandas dataframes)

In [30]:
dfx = pd.read_csv("https://pokelab.ddns.net/datasets/22_07_20-1.csv")
dfy = pd.read_csv("https://pokelab.ddns.net/datasets/22_07_20-2.csv")

display(dfx.head())
display(dfy.head())

   Unnamed: 0         A         C         E  class
0           0 -0.386248  1.536628  1.232589      1
1           1 -2.686649  4.640702  0.823433      1
2           2  0.474124  1.576616 -1.256234      0
3           3 -1.343790 -0.514008  1.520392      2
4           4 -2.187600  0.289041  1.318321      2

   Unnamed: 0         B         D         F  class
0           0 -1.432057  1.039420  0.280469      1
1           1 -4.036329  0.526320 -0.419013      1
2           2  0.179770  0.157974 -0.162869      0
3           3 -1.299109 -0.152250  0.045123      2
4           4 -2.089699 -0.494995 -0.661858      2

,Unnamed: 0,A,C,E,class_x,B,D,F,class_y
0,0,-0.386248,1.536628,1.232589,1,-1.432057,1.039420,0.280469,1
1,1,-2.686649,4.640702,0.823433,1,-4.036329,0.526320,-0.419013,1
2,2,0.474124,1.576616,-1.256234,0,0.179770,0.157974,-0.162869,0
3,3,-1.343790,-0.514008,1.520392,2,-1.299109,-0.152250,0.045123,2
4,4,-2.187600,0.289041,1.318321,2,-2.089699,-0.494995,-0.661858,2

### DATASET MERGE

In [ ]:
df = dfx.merge(dfy, on="Unnamed: 0",suffixes=["_x","_y"])
display(df.head())

## DATASET CLEANING
2. Delete all the rows where class_x is different from class_y, then
drop class_y and rename class_x as class

In [31]:
df.drop(df[df.class_x != df.class_y].index,inplace=True)
df.drop(columns="class_y",inplace=True)
df.rename(columns={"class_x":"class"}, inplace=True)

,Unnamed: 0,A,C,E,class,B,D,F
0,0,-0.386248,1.536628,1.232589,1,-1.432057,1.039420,0.280469
1,1,-2.686649,4.640702,0.823433,1,-4.036329,0.526320,-0.419013
2,2,0.474124,1.576616,-1.256234,0,0.179770,0.157974,-0.162869
3,3,-1.343790,-0.514008,1.520392,2,-1.299109,-0.152250,0.045123
4,4,-2.187600,0.289041,1.318321,2,-2.089699,-0.494995,-0.661858

the size of the cleaned dataframe is 15872

3. Reorder the columns in alphabetical order, but placing the class
column as the last one; the cleaned dataframe must be named
df; show its size and head

In [ ]:
df.sort_index(axis=1)
display(df.head())
print("the size of the cleaned dataframe is {}".format(df.size))

4. Find the best classification scheme using three classification
methods
5. For each classification method find the best parameter setting
with cross validation on the training set
(6pt)
6. For each classification method compute the accuracy and the
confusion matrix on the test set
(4pt)
7. Produce a plot of the accuracies given by the methods
attempted
(3pt)
Quality of the code:
(6pt)
• Include appropriate comments with reference to the numbered
requirements
• Useless cells, pieces of code and non-required output will be
penalized
o Remove the code you use for testing and inspecting the
variables during the development
• Naming style of variables must be uniform and in English
• Bad indentation and messy code will be penalized